{
  "highlights": [
    "Proven track record of delivering sophisticated, yet easy-to-use user interfaces.",
    "Worked at various capacities on several successful SAAS products and developed a full appreciation of the software development lifecycle, from requirements gathering to test automation.",
    "Innate ability to find elegant solutions that aid in the understanding and usefulness of large datasets and complex analytics."
  ],
  "work": [{
    "company": "Informa Investment Solutions",
    "location": "Zephyr Cove, NV",
    "position": "Senior Software Engineer",
    "website": "https://informais.com",
    "startDate": "2010-5-01",
    "endDate": "",
    "dateRange": "May 2010 - Present",
    "summary": "Lead UX engineer for flagship financial software platform. Created a 'living' style guide and suite of UI patterns for use in multiple front-end UI frameworks. Work with multiple engineering and product teams to ensure consistency and usability across components, as well as implement key interface components.",
    "highlights": [
      "Lead UX engineer for flagship financial software platform. Created a 'living' style guide and suite of UI patterns for use in multiple front-end UI frameworks. Work with multiple engineering and product teams to ensure consistency and usability across components, as well as implement key interface components such as a data selection widget.  ",
      "Lead engineer of Zephyr OnDEMAND, a web-based financial reporting and interactive analytics application. Managed two direct reports along with an outsourced development team over the course of the product’s active development.",
      "Developed visual-search UI to analyze millions of mutual fund scoring results and underlying statistics."
    ]
  }, {
    "company": "WebXL Consulting LLC",
    "location": "Reno, NV",
    "position": "Principal",
    "website": "https://webxl.net",
    "startDate": "2008-9-01",
    "endDate": "2010-4-30",
    "dateRange": "December 2008 – May 2010",
    "summary": "On behalf of clients, analyzed business processes and requirements, provided code-level customizations and performed data migration services for open source CRM suite SugarCRM. Sample customizations using the PHP based framework included developing logic hooks to permit data synchronization with an accounting application over SOAP, dynamic dropdown lists based on user input, order processing and license management automation, and “Cloud Connector” integration to display third party credit information of prospective customers."
  },
    {
      "company": "SugarCRM",
      "location": "Cupertino, CA",
      "position": "Principal",
      "website": "http://sugarcrm.com",
      "startDate": "2007-5-30",
      "endDate": "2010-4-30",
      "dateRange": "May 2007 - October 2008",
      "summary": "Customized installations of SugarCRM to meet client requirements. Solutions consisted of various PHP and JavaScript modifications and custom object-oriented modules specific to business practices, as well as data migration and third party integration."
    },
    {
      "company": "Scalable Network Technologies",
      "location": "Los Angeles, CA",
      "position": "Release Manager",
      "website": "http://web.scalable-networks.com/",
      "startDate": "2002-9-01",
      "endDate": "2007-5-30",
      "dateRange": "September 2002 - May 2007",
      "summary": "Responsible for the configuration and release management of an advanced network simulation application.  Produced specialized releases for service contracts in addition to several generic releases and optional modules for each product version. Automated build process on multiple platforms reducing the amount of time between releases and improving product quality.  Ensured products perform to specification on a variety of operating systems and architectures.  Wrote numerous scripts (Unix Shell, Perl, Batch) and dynamic web pages (PHP, DHTML) to manage release processes and configurations."
    }
  ],
  "volunteer": [],
  "education": [{
    "institution": "Stanford University",
    "area": "Economics",
    "studyType": "Bachelor of Arts Economics; Computer Science Minor",
    "startDate": "1995-09-30",
    "endDate": "2000-01-01",
    "dateRange": "January 2000",
    "gpa": "",
    "courses": []
  }]
}
